{
  "backend/main.mo": "Motoko canister implementing access‑controlled user profiles, post records, and infrastructure for chunked media uploads with placeholder handlers.",
  "feature_evidence.json": "Feature evidence report documenting favicon-related updates and impacted components with associated test IDs.",
  "frontend-file-summaries.txt": "Collected one‑sentence summaries of all frontend source files for reference or build tooling.",
  "frontend/index.css": "Global Tailwind‑based OKLCH color theme defining light/dark mode tokens and base styling.",
  "frontend/index.html": "HTML entry point defining updated favicon links and loading the React application.",
  "frontend/src/App.tsx": "Main React component managing authentication, profile setup, routing among landing/feed/viewer/upload, and global UI layout.",
  "frontend/src/components/feed/Feed.tsx": "Paginated feed that loads posts, shows loading/error states, and provides navigation.",
  "frontend/src/components/feed/PostCard.tsx": "Displays a post’s media preview, detecting image or video and creating a preview URL.",
  "frontend/src/components/Header.tsx": "Header with logo, greeting text, and authentication/upload controls using Internet Identity.",
  "frontend/src/components/Landing.tsx": "Marketing landing page with hero video and three orange‑shadow feature cards in a two‑row layout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting for a profile name with input handling and save button state.",
  "frontend/src/components/upload/UploadButton.tsx": "Simple upload trigger button with an icon.",
  "frontend/src/components/upload/UploadComposer.tsx": "Handles file selection and chunked upload with progress, cancel support, and success/error feedback.",
  "frontend/src/components/viewer/PostViewer.tsx": "Displays a full post with media, author checks, sharing, and deletion options.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useChunkedUpload.ts": "Manages chunked file uploads with retries, cancellation, progress tracking, and finalization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and posts through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables, including light/dark theme colors and custom UI utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/chunking.ts": "Implements file chunking utilities for slicing files, counting chunks, and computing byte ranges.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Describes the project’s state, favicon-related issues, requirements, and pending feature requests."
}