{
  "backend/main.mo": "Motoko canister handling access control, user profiles, posts, and a chunked media upload system with internal maps, timers, and validation.",
  "feature_evidence.json": "Feature evidence manifest listing implemented features, related files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing their roles in the app UI, upload flow, and styling.",
  "frontend/index.css": "Tailwind base styles defining the app’s light/dark OKLCH color theme and core CSS variables.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component managing authentication, profile setup, routing between feed/viewer/upload views, and shared post URL handling.",
  "frontend/src/components/feed/Feed.tsx": "Displays a paginated grid of posts, handling loading, errors, and navigation between pages.",
  "frontend/src/components/feed/PostCard.tsx": "Renders a post preview card, generating a media URL and detecting video content for display.",
  "frontend/src/components/Header.tsx": "Header with logo, upload button, and Internet Identity login/logout handling.",
  "frontend/src/components/Landing.tsx": "Unauthenticated landing screen with welcome text and icon.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first‑time profile setup allowing name entry and save.",
  "frontend/src/components/upload/UploadButton.tsx": "Simple button component that triggers the upload flow when clicked.",
  "frontend/src/components/upload/UploadComposer.tsx": "Manages file selection and chunked upload UI, showing progress and handling cancel or completion.",
  "frontend/src/components/viewer/PostViewer.tsx": "Shows a full post with media, supports sharing and deletion, and handles loading and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useChunkedUpload.ts": "Handles chunked media uploads with retry, cancellation, progress tracking, and finalization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/clear functions, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles and posts using an actor instance.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark theme colors and radius values.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/chunking.ts": "Utilities for slicing files into 512KB chunks, computing chunk counts, and determining byte ranges.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, plugins, and responsive container settings.",
  "project_state.json": "Describes the project state, features, and requirements for an ICP media-sharing app with chunked uploads."
}