{
  "backend/main.mo": "Motoko canister providing access‑controlled user profiles plus post and chunk structures with placeholder chunked‑upload logic.",
  "feature_evidence.json": "Feature evidence report documenting an update to use a 64×64 PNG favicon in frontend/index.html.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend component, hook, utility, and configuration file.",
  "frontend/index.css": "Tailwind‑based global CSS defining OKLCH color tokens and dark‑mode overrides for the UI.",
  "frontend/index.html": "HTML entry point loading main.tsx and referencing the generated 64×64 PNG favicon.",
  "frontend/src/App.tsx": "Root React component managing auth state, profile setup, post viewing, uploads, and main navigation flow.",
  "frontend/src/components/feed/Feed.tsx": "Renders a paginated grid of PostCards with loading, error, and navigation controls.",
  "frontend/src/components/feed/PostCard.tsx": "Displays a post preview, detecting image/video media and generating a blob URL for rendering.",
  "frontend/src/components/Header.tsx": "Header with logo, greeting text, and login/logout plus upload controls tied to Internet Identity.",
  "frontend/src/components/Landing.tsx": "Landing page with hero video and three marketing cards styled with orange shadows.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting first‑time users to enter and save their display name.",
  "frontend/src/components/upload/UploadButton.tsx": "Simple button component that triggers an upload action.",
  "frontend/src/components/upload/UploadComposer.tsx": "Provides a file picker and chunked upload UI with progress, cancel, and success handling.",
  "frontend/src/components/viewer/PostViewer.tsx": "Shows a full post with media display, share link creation, and deletion for the author.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useChunkedUpload.ts": "Handles chunked media uploads with progress tracking, retry logic, cancellation, and feed invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and identity persistence for the app.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and mutate user profiles and posts via the actor, including paginated post retrieval and deletion.",
  "frontend/src/index.css": "Defines global Tailwind layers, CSS variables for light/dark themes, and custom styles for branding and shadows.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/chunking.ts": "Implements file chunking utilities for slicing files, counting chunks, and calculating byte ranges.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters with sessionStorage fallbacks.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and plugins for the project.",
  "project_state.json": "Describes the project state, requirements, existing features, and notes including chunked uploads and favicon needs."
}