{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, posts, chunked uploads, and internal state for media handling.",
  "feature_evidence.json": "Feature evidence report listing frontend files affected by specific UI update requirements and their associated metadata.",
  "frontend-file-summaries.txt": "Text file providing short descriptions of key frontend components, hooks, utilities, and configuration files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and theme settings for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React app and favicon with appropriate metadata tags.",
  "frontend/src/App.tsx": "Main React app controlling authentication, routing between views, profile setup, uploads, and footer rendering.",
  "frontend/src/components/feed/Feed.tsx": "Paginated post feed that loads posts, shows loading/error states, and handles page navigation.",
  "frontend/src/components/feed/PostCard.tsx": "Displays a post's media with basic video detection and click handling.",
  "frontend/src/components/Header.tsx": "Header with circular logo, authentication controls, and upload button for logged-in users.",
  "frontend/src/components/Landing.tsx": "Unauthenticated landing page with circular hero video, title/subtitle, and three marketing cards including GeekGoat image.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting user to enter their name with save handling and disabled state logic.",
  "frontend/src/components/upload/UploadButton.tsx": "Simple upload button triggering an external click handler.",
  "frontend/src/components/upload/UploadComposer.tsx": "File upload UI supporting selection, chunked upload, progress display, and cancellation.",
  "frontend/src/components/viewer/PostViewer.tsx": "Viewer for a single post with media display, share link, and optional delete for the author.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useChunkedUpload.ts": "Handles chunked media uploads with retry logic, cancellation, progress tracking, and finalization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity auth, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and posts using the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark mode, applying global colors and typography.",
  "frontend/src/main.tsx": "Bootstraps the app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/chunking.ts": "Implements helpers to slice files into fixed-size chunks and compute chunk ranges for uploads.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Tracks project metadata, requirements, and architectural notes for an ICP media-sharing app with chunked uploads."
}