{
  "kind": "build_request",
  "title": "Update header layout, landing title styling, and footer social links",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Update the header layout so the LookyLoo circular logo is positioned on the far left, and place the exact text \"Hey there, LookyLoo!  Wanna see somethin'?\" immediately to the right of the logo, while keeping the auth controls and (when authenticated) Upload button aligned on the right side of the header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "far left with text to the right of it.",
          "Header:  That log is correct but move it to the far left and add, \"Hey there, LookyLoo!  Wanna see somethin'?\""
        ]
      },
      "acceptanceCriteria": [
        "In the header, the logo appears at the far left of the header row (no longer centered).",
        "The header displays the exact sentence \"Hey there, LookyLoo!  Wanna see somethin'?\" to the right of the logo (including the double space between the sentences).",
        "The Login/Logout control remains on the right side; when authenticated, the Upload button also remains on the right side.",
        "No layout shift occurs for the logo sizing compared to the current circular logo presentation."
      ]
    },
    {
      "id": "REQ-13",
      "text": "On the unauthenticated landing page only, style the title text \"LookyLoo\" to be orange and use a calligraphy-style (or close) font; do not apply this orange/calligraphy styling to the header text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Make the words, \"LookyLoo\" orange and caligraphy-type font or close to that type of font.",
          "Not the header.  Only the title ."
        ]
      },
      "acceptanceCriteria": [
        "The landing page H1 title \"LookyLoo\" renders in orange.",
        "The landing page H1 title uses a calligraphy-style (or close) font distinct from the default sans font.",
        "Header text does not inherit this orange/calligraphy styling."
      ]
    },
    {
      "id": "REQ-14",
      "text": "In the footer \"Follow me on\" row, make only the GeekGoat icon and the X icon clickable; set the X icon click target to navigate to https://x.com/WillGeek4Food. Do not make the entire row clickable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "In the footer where we have 'follow on X\" make the X logo navigate to: https://x.com/WillGeek4Food",
          "Just the X and GeekGoat icons should be clickable."
        ]
      },
      "acceptanceCriteria": [
        "Clicking the X icon navigates to https://x.com/WillGeek4Food.",
        "The GeekGoat icon is independently clickable (focusable/clickable element) without making the surrounding footer row clickable.",
        "Clicking non-icon text/areas in the footer row (e.g., \"Follow me on\") does not navigate anywhere."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the existing LookyLoo logo asset usage (/assets/lookyloo-logo.png) and circular framing; only reposition within the header layout.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "No changes to backend Motoko canister logic or data models.",
    "No changes to the chunked upload protocol or feed/viewer behavior beyond layout/styling impacts required by the header/footer updates.",
    "Do not make the entire footer \"Follow me on\" row a single clickable link."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}