{
  "kind": "build_request",
  "title": "Branding & landing page cosmetic refresh (hero video, header/footer, cards, favicon)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Update the unauthenticated landing page (frontend/src/components/Landing.tsx) to replace the current camera icon + copy with a centered hero section that includes: (1) a large circular hero media element that plays the provided LookyLoo-gif.mp4, (2) title text exactly \"LookyLoo\", (3) subtitle text exactly \"A Li'l Media Share on ICP\", and (4) three uniform hero cards below the subtitle with the specified marketing copy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "1. attached is the logo. make it the center page, kinda big, and put it in a circle. attached LookyLoo-gif.mp4",
          "2. change \"Welcome to LookyLoo\" to just \"LookyLoo\". Under that text, \"A Li'l Media Share on ICP\"",
          "6. Add hero cards on the main page below the logo and LookyLoo taglines. 3 uniform cards. card A: Share your media with the world. Uses ICP ID2 for login, no personal information needed. Ever. Card B: Easy to Use. Easy to Share. Blockchain encryptied and owned only by you. You decide who sees it. Card C: Built, designed and deployed by GeekDice - A Non-Dev. Try it yourself at caffeine.ai.",
          "1. no. the logo is there. it's called: LookyLoo-gif.mp4"
        ]
      },
      "acceptanceCriteria": [
        "When logged out, the Landing page shows a large circular hero element that renders the LookyLoo-gif.mp4 media centered above the title.",
        "The Landing title reads exactly \"LookyLoo\" and the subtitle reads exactly \"A Li'l Media Share on ICP\".",
        "Three cards render below the subtitle and maintain equal widths/heights at the same breakpoint (uniform presentation).",
        "Card A text reads exactly: \"Share your media with the world. Uses ICP ID2 for login, no personal information needed. Ever.\"",
        "Card B text reads exactly: \"Easy to Use. Easy to Share. Blockchain encryptied and owned only by you. You decide who sees it.\"",
        "Card C text reads exactly: \"Built, designed and deployed by GeekDice - A Non-Dev. Try it yourself at caffeine.ai.\""
      ]
    },
    {
      "id": "REQ-8",
      "text": "Update Card C in the Landing hero cards so that the provided GeekGoat-e8cRlk9m.png image is displayed in a circle, centered above the Card C text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "7. In card C put my personal logo GeekGoat.png attached in a circle with the text.",
          "3. Centered above"
        ]
      },
      "acceptanceCriteria": [
        "Card C shows the GeekGoat-e8cRlk9m.png image clipped to a circle.",
        "The GeekGoat image is horizontally centered and positioned above the Card C text content."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Update the header (frontend/src/components/Header.tsx) to remove the currently referenced /assets/LookyLoo-Logo.png and replace it with the uploaded lookyloo-logo.png displayed in a circular frame, remaining centered in the header without layout shift.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "3. Header: Remove the logo thats there and replace with attached lookyloo-logo.png. also put it in a circle"
        ]
      },
      "acceptanceCriteria": [
        "Header no longer references /assets/LookyLoo-Logo.png.",
        "Header renders lookyloo-logo.png as the centered logo.",
        "Logo is displayed inside a circle (clipped/masked) and remains crisp/responsive across common breakpoints."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Update the footer (frontend/src/App.tsx) to remove the existing copyright/link sentence and replace it with: first line exactly \"2026 LookyLoo. A GeekDice dApp built with caffeine.ai\" and a second line below it (single line, centered) that shows: <GeekGoat-e8cRlk9m.png in a circle> then the text \"Follow me on\" then the X Logo Transparent.png icon.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "5. Footer. Delete the text and replace with \"2026 LookyLoo. A GeekDice dApp built with caffeine.ai\"",
          "8. Footer: on a single line under \"2026 LookyLoo..\" create, \"<GeekGoat.png in a circle>Follow me on <X Logo Transparent.png>\"",
          "2. exactly. centered and all one line."
        ]
      },
      "acceptanceCriteria": [
        "Footer displays exactly two rows of content.",
        "Row 1 text matches exactly: \"2026 LookyLoo. A GeekDice dApp built with caffeine.ai\".",
        "Row 2 is a single centered line containing (in order): circular GeekGoat-e8cRlk9m.png, the text \"Follow me on\", and the X Logo Transparent.png icon.",
        "Footer no longer includes the previous dynamic year or the previous caffeine.ai UTM link block."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Install and wire up the provided favicon.ico so it appears in the browser tab for the app (update the HTML entry point to reference it).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "4. Install favicon.ico (attached) for the browser tab"
        ]
      },
      "acceptanceCriteria": [
        "The built app includes a favicon.ico at the expected public path.",
        "The HTML entry point references the favicon.ico so the browser tab shows the favicon."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (compose them instead).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep backend behavior unchanged; these are cosmetic/branding updates only."
  ],
  "nonGoals": [
    "Changing Internet Identity behavior or introducing multiple distinct account profiles beyond Internet Identity anchors.",
    "Changing the chunked upload protocol, post APIs, pagination, or authorization logic.",
    "Adding third-party auth providers or social API integrations for X beyond displaying the provided X icon."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}